Repository: Leafuke/FolderRewind
Catalog: FolderRewind/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# PluginService_UninstallSuccess
source: Uninstalled successfully
zh_cn: 卸载成功

# PluginService_UpdatesAvailable
source: Updates available. See the plugin list for details.
zh_cn: 发现可用更新，请在插件列表中查看详情

# PluginService_NoUpdatesAvailable
source: All plugins are up to date.
zh_cn: 所有插件均为最新版本

# PluginService_NoUpdateUrl
source: No update download URL available
zh_cn: 无可用的更新下载链接

# SettingsPage_KnotLink.Text
source: KnotLink integration
zh_cn: KnotLink 互联

# SettingsPage_KnotLinkEnabled.Text
source: Enable integration
zh_cn: 启用互联功能

# SettingsPage_KnotLinkEnabledDesc.Text
source: Allow other apps to control backup tasks via KnotLink protocol
zh_cn: 允许其他应用通过 KnotLink 协议控制备份任务

# SettingsPage_KnotLinkStatus.Text
source: Connection status
zh_cn: 连接状态

# SettingsPage_KnotLinkRestart.Content
source: Restart service
zh_cn: 重启服务

# SettingsPage_KnotLinkTest.Content
source: Test connection
zh_cn: 测试连接

# SettingsPage_KnotLinkSendCustom.Content
source: Send custom message
zh_cn: 发送自定义信息

# SettingsPage_KnotLinkCommands.Header
source: Supported commands
zh_cn: 支持的命令

# SettingsPage_KnotLinkCommandsDesc.Text
source: The following commands can be called via KnotLink:
zh_cn: 以下命令可通过 KnotLink 远程调用：

# SettingsPage_KnotLinkCommandsBody.Text
source: Strict key-value protocol: cmd=get_capabilities cmd=PING cmd=LIST_CONFIGS cmd=LIST_FOLDERS;config_id=ID cmd=LIST_BACKUPS;config_id=ID;folder=folder%20name cmd=BACKUP;from=example.client;request_id=req-backup-001;config_id=ID;folder=folder%20name;comment=note;backup_mode=full;compression_method=zstd;compression_level=11;backup_blacklist=cache,logs;backup_whitelist=level.dat,region%2Fr.0.0.mca cmd=BACKUP;from=example.client;request_id=req-backup-002;config_id=ID;folder=folder%20name;backup_scope=selected-regions;scope_dimensions=overworld,nether;scope_areas=0%2C0%2C511%2C511 cmd=RESTORE;from=example.client;request_id=req-restore-001;config_id=ID;folder=folder%20name;file=backup.7z;mode=clean;restore_whitelist=options.txt,playerdata cmd=AUTO_BACKUP;from=example.client;request_id=req-auto-001;config_id=ID;folder=folder%20name;interval_minutes=10 MineRewind Plugin API v3 commands: cmd=BACKUP;from=minebackup.mod;request_id=req-mr-backup-001;current_save=true;comment=QuickSave cmd=LIST_BACKUPS;current_save=true cmd=RESTORE;from=minebackup.mod;request_id=req-mr-restore-001;current_save=true cmd=RESTORE;from=minebackup.mod;request_id=req-mr-restore-002;current_save=true;file=backup.7z;preserve_player_data=true Keys use letters, digits, and underscores only. Values must be percent-encoded. Lists use comma-separated, individually encoded items. Requests without cmd are rejected.
zh_cn: 严格键值对协议： cmd=get_capabilities cmd=PING cmd=LIST_CONFIGS cmd=LIST_FOLDERS;config_id=ID cmd=LIST_BACKUPS;config_id=ID;folder=%E6%96%87%E4%BB%B6%E5%A4%B9%E5%90%8D%E7%A7%B0 cmd=BACKUP;from=example.client;request_id=req-backup-001;config_id=ID;folder=%E6%96%87%E4%BB%B6%E5%A4%B9;comment=%E6%B3%A8%E9%87%8A;backup_mode=full;compression_method=zstd;compression_level=11;backup_blacklist=cache,logs;backup_whitelist=level.dat,region%2Fr.0.0.mca cmd=BACKUP;from=example.client;request_id=req-backup-002;config_id=ID;folder=%E6%96%87%E4%BB%B6%E5%A4%B9;backup_scope=selected-regions;scope_dimensions=overworld,nether;scope_areas=0%2C0%2C511%2C511 cmd=RESTORE;from=example.client;request_id=req-restore-001;config_id=ID;folder=%E6%96%87%E4%BB%B6%E5%A4%B9;file=backup.7z;mode=clean;restore_whitelist=options.txt,playerdata cmd=AUTO_BACKUP;from=example.client;request_id=req-auto-001;config_id=ID;folder=%E6%96%87%E4%BB%B6%E5%A4%B9;interval_minutes=10 MineRewind Plugin API v3 命令： cmd=BACKUP;from=minebackup.mod;request_id=req-mr-backup-001;current_save=true;comment=QuickSave cmd=LIST_BACKUPS;current_save=true cmd=RESTORE;from=minebackup.mod;request_id=req-mr-restore-001;current_save=true cmd=RESTORE;from=minebackup.mod;request_id=req-mr-restore-002;current_save=true;file=backup.7z;preserve_player_data=true 键名仅使用字母、数字和下划线；值必须 percent-encode；列表使用逗号分隔并逐项编码。未带 cmd 的旧协议请求会被拒绝。

# SettingsPage_NavPaneWidth.Text
source: Navigation pane width
zh_cn: 导航栏宽度

# SettingsPage_NavPaneWidthDesc.Text
source: Adjust the width of the expanded navigation pane
zh_cn: 调整左侧导航栏展开时的宽度

# SettingsPage_StartupSize.Text
source: Startup window size
zh_cn: 启动窗口大小

# SettingsPage_StartupSizeDesc.Text
source: Set window size at launch for larger or multi-monitor setups
zh_cn: 设定应用启动时的窗口宽高，便于大屏或多显示器使用

# SettingsPage_ApplySize.Content
source: Apply now
zh_cn: 立即应用

# Startup_SetFailed
source: [Startup] Failed to set startup: {0}
zh_cn: [Startup] 设置开机自启失败：{0}

# Startup_DisabledByUser
source: [Startup] Startup is disabled by user in Task Manager
zh_cn: [Startup] 开机自启已被用户在任务管理器中禁用

# Startup_DisabledByPolicy
source: [Startup] Startup is disabled by group policy
zh_cn: [Startup] 开机自启已被组策略禁用

# Startup_DisabledByUser_Title
source: Cannot Enable Startup
zh_cn: 无法启用开机自启

# Startup_DisabledByUser_Content
source: Startup has been disabled in Task Manager. Please enable FolderRewind manually in the "Startup apps" tab of Task Manager.
zh_cn: 开机自启已在任务管理器中被禁用。请在任务管理器的"启动应用"选项卡中手动启用 FolderRewind。

# Config_ParseNull_Reset
source: [Config] Config parsed as null; resetting to default.
zh_cn: [Config] 配置文件解析结果为 null，将重置为默认配置。

# Config_LoadFailed_Reset
source: [Config] Failed to load config; resetting to default: {0}
zh_cn: [Config] 配置加载失败，将重置为默认配置：{0}

# Config_SaveFailed
source: [Config] Failed to save config: {0}
zh_cn: [Config] 配置保存失败：{0}

# Config_OpenConfigDirFailed
source: [Config] Failed to open config directory: {0}
zh_cn: [Config] 无法打开配置目录：{0}

# Config_OpenConfigFileFailed
source: [Config] Failed to open config file: {0}
zh_cn: [Config] 无法打开配置文件：{0}

# PluginStore_Log_DownloadInstallFailed
source: [PluginStore] Download/install failed: {0}
zh_cn: [PluginStore] 下载/安装失败：{0}

# PluginStore_GetReleaseFailed_Log
source: [PluginStore] Failed to fetch latest release: {0}
zh_cn: [PluginStore] 获取 Release 失败：{0}

# PluginService_CreatePluginDirFailed
source: [Plugin] Unable to create plugins directory: {0}
zh_cn: [Plugin] 无法创建插件目录：{0}

# PluginService_ScanPluginsFailed
source: [Plugin] Failed to scan plugins: {0}
zh_cn: [Plugin] 扫描插件失败：{0}

# PluginService_InstallFailed_Log
source: [Plugin] Install failed: {0}
zh_cn: [Plugin] 安装失败：{0}

# PluginService_UninstallFailed_Log
source: [Plugin] Uninstall failed: {0} - {1}
zh_cn: [Plugin] 卸载失败：{0} - {1}

# PluginService_OpenPluginFolderFailed
source: [Plugin] Failed to open plugins folder: {0}
zh_cn: [Plugin] 打开插件目录失败：{0}

# PluginService_ManifestParseFailed
source: [Plugin] Manifest parse failed: {0} - {1}
zh_cn: [Plugin] manifest 解析失败：{0} - {1}

# PluginService_VersionIncompatible
source: [Plugin] Incompatible version: {0} - {1}
zh_cn: [Plugin] 版本不兼容：{0} - {1}

# PluginService_Loaded
source: [Plugin] Loaded: {0} ({1} {2})
zh_cn: [Plugin] 已加载：{0} ({1} {2})

# PluginService_LoadFailed
source: [Plugin] Load failed: {0} - {1}
zh_cn: [Plugin] 加载失败：{0} - {1}

# PluginService_ReadInfoFailed
source: [Plugin] Failed to read plugin info: {0} - {1}
zh_cn: [Plugin] 读取插件信息失败：{0} - {1}

# KnotLink_Disabled_SkipInit
source: [KnotLink] Service disabled; skipping initialization.
zh_cn: [KnotLink] 服务已禁用，跳过初始化。

# KnotLink_InitSuccess
source: [KnotLink] Initialized successfully - AppId: {0}, Host: {1}
zh_cn: [KnotLink] 服务初始化成功 - AppId: {0}, Host: {1}

# KnotLink_InitFailed
source: [KnotLink] Initialization failed: {0}
zh_cn: [KnotLink] 服务初始化失败: {0}

# KnotLink_SenderInitSuccess
source: [KnotLink] Signal sender initialized successfully
zh_cn: [KnotLink] 信号发送器初始化成功

# KnotLink_SenderInitFailed
source: [KnotLink] Signal sender initialization failed: {0}
zh_cn: [KnotLink] 信号发送器初始化失败: {0}

# KnotLink_CommandReceived
source: [KnotLink] Command received: {0}
zh_cn: [KnotLink] 收到命令: {0}

# KnotLink_CommandResponse
source: [KnotLink] Response: {0}
zh_cn: [KnotLink] 响应: {0}

# KnotLink_CommandParseFailed_Log
source: [KnotLink] Command parse failed: {0}
zh_cn: [KnotLink] 指令解析失败：{0}

# KnotLink_CommandExecutionFailed_Log
source: [KnotLink] Command execution failed: {0}, error: {1}
zh_cn: [KnotLink] 指令执行失败：{0}，错误：{1}

# KnotLink_CommandFailed_Notification
source: KnotLink command failed: {0}
zh_cn: KnotLink 指令处理失败：{0}

# KnotLink_Error_MissingConfigId
source: Missing config_id field. Example: config_id=ID
zh_cn: 缺少 config_id 参数。示例：config_id=ID

# KnotLink_Error_MissingFolderName
source: Missing folder field. Example: folder=folder%20name
zh_cn: 缺少 folder 参数。示例：folder=%E6%96%87%E4%BB%B6%E5%A4%B9

# KnotLink_Error_MissingBackupFile
source: Missing file field. Example: file=backup.7z
zh_cn: 缺少 file 参数。示例：file=backup.7z

# KnotLink_Error_InvalidBool
source: Invalid boolean value for {0}: {1}
zh_cn: 布尔参数 {0} 的值无效：{1}

# KnotLink_Error_InvalidRestoreMode
source: Invalid restore mode: {0}. Use clean or overwrite.
zh_cn: 无效还原模式：{0}。可用值：clean 或 overwrite。

# KnotLink_Error_InvalidInterval
source: interval_minutes must be an integer greater than or equal to 1.
zh_cn: interval_minutes 必须是大于等于 1 的整数。

# KnotLink_Error_ConfigCloneFailed
source: Unable to create a temporary configuration for this command.
zh_cn: 无法创建本次指令使用的临时配置。

# KnotLink_Error_MissingConversationMetadata
source: Missing conversation metadata: {0}. Add from=source and request_id=requestId.
zh_cn: 缺少会话元数据：{0}。请追加 from=来源 和 request_id=请求ID。

# KnotLink_ResponderInitSuccess
source: [KnotLink] Command responder initialized successfully
zh_cn: [KnotLink] 命令响应器初始化成功

# KnotLink_ResponderInitFailed
source: [KnotLink] Command responder initialization failed: {0}
zh_cn: [KnotLink] 命令响应器初始化失败: {0}

# KnotLink_Shutdown
source: [KnotLink] Service shut down
zh_cn: [KnotLink] 服务已关闭

# KnotLink_BroadcastFailed
source: [KnotLink] Failed to broadcast event: {0}
zh_cn: [KnotLink] 广播事件失败: {0}

# KnotLink_AutoBackupStarted
source: [KnotLink] Auto backup started: {0}, interval {1} minutes
zh_cn: [KnotLink] 自动备份任务已启动: {0}, 间隔 {1} 分钟

# KnotLink_AutoBackupExecute
source: [KnotLink] Running auto backup: {0}
zh_cn: [KnotLink] 执行自动备份: {0}

# KnotLink_AutoBackupFailed
source: [KnotLink] Auto backup failed: {0}
zh_cn: [KnotLink] 自动备份失败: {0}

# KnotLink_AutoBackupStopped
source: [KnotLink] Auto backup stopped: {0}
zh_cn: [KnotLink] 自动备份任务已停止: {0}

# SettingsPage_KnotLink_RestartSuccess
source: Service restarted.
zh_cn: 服务已重启

# SettingsPage_KnotLink_RestartFailed
source: Service restart failed. Check configuration and logs.
zh_cn: 服务重启失败，请检查配置和日志

# SettingsPage_KnotLinkTest_Title
source: KnotLink test
zh_cn: KnotLink 测试

# SettingsPage_KnotLinkTest_NotInitialized
source: Service not initialized. Please click [Restart service] first.
zh_cn: 服务未初始化，请先点击 [重启服务]

# SettingsPage_KnotLinkTest_Broadcasted
source: Test event broadcast. If you have a listener subscribed to this signal, it should receive a message.
zh_cn: 测试事件已广播。 如果您有监听器订阅了此信号，应该能收到消息。

# SettingsPage_KnotLinkSendCustom_Title
source: Send custom command
zh_cn: 发送自定义指令

# SettingsPage_KnotLinkSendCustom_Placeholder
source: Enter a strict key-value command, for example cmd=PING
zh_cn: 输入严格键值对指令，例如 cmd=PING

# SettingsPage_KnotLinkSendCustom_Empty
source: Command cannot be empty
zh_cn: 指令不能为空

# SettingsPage_KnotLinkSendCustom_ResultTitle
source: Remote response
zh_cn: 远端响应

# App_Log_KnotLinkInitException
source: [KnotLink] Init exception: {0}
zh_cn: [KnotLink] 初始化异常: {0}

# Config_DefaultBackupName
source: Default Config
zh_cn: 示例配置

# FolderManager_Status
source: Ready
zh_cn: 就绪

# BackupService_Log_ConfigTaskBegin
source: === Starting task: {0} ===
zh_cn: === 开始执行配置任务: {0} ===

# BackupService_Log_TaskEnd
source: === Task finished ===
zh_cn: === 任务结束 ===

# BackupService_Task_Preparing
source: Preparing...
zh_cn: 准备中...

# BackupService_Task_Processing
source: Processing...
zh_cn: 正在处理...

# BackupService_Task_Completed
source: Completed
zh_cn: 完成

# BackupService_Task_NoChanges
source: No changes
zh_cn: 无变更

# BackupService_Task_Failed
source: Failed
zh_cn: 失败

# BackupService_Task_Exception
source: Exception
zh_cn: 异常

# BackupService_Task_PluginProcessing
source: Processing (plugin)...
zh_cn: 插件处理中...

# BackupService_Folder_SourceNotFound
source: Source not found
zh_cn: 源不存在

# BackupService_Folder_NoMatchingFiles
source: No files currently match
zh_cn: 当前没有匹配文件

# BackupService_Folder_TargetNotSet
source: Destination not set
zh_cn: 未设置目标

# BackupService_Folder_SourceDestinationOverlap
source: Source and backup storage overlap: {0} ↔ {1}
zh_cn: 来源与备份存储路径重叠：{0} ↔ {1}

# GameDiscovery_Resource_UnsafeRoot
source: Blocked because the rule resolves to an unsafe root path
zh_cn: 规则解析到不安全的根路径，已阻止选择

# GameDiscovery_BroadRootConfirm_Title
source: Confirm broad backup sources
zh_cn: 确认宽范围备份来源

# GameDiscovery_BroadRootConfirm_Content
source: These sources cover broad system, user, or game-library roots. Confirm that you intend to review them for backup:\n{0}
zh_cn: 以下来源覆盖系统、用户或游戏平台宽根目录。请确认你确实要将其带入备份审查：\n{0}

# BackupService_Folder_BackupInProgress
source: Backing up...
zh_cn: 正在备份...

# BackupService_Folder_BackupRunning
source: Backup in progress...
zh_cn: 备份中...

# BackupService_Folder_BackupCompleted
source: Backup completed
zh_cn: 备份完成

# BackupService_Folder_BackupFailed
source: Backup failed
zh_cn: 备份失败

# BackupService_Folder_PluginBackingUp
source: Backing up (plugin)...
zh_cn: 插件备份中...

# BackupService_Folder_PluginException
source: Plugin exception
zh_cn: 插件异常

# BackupService_Log_SourceFolderMissing
source: Source folder not found: {0}
zh_cn: 源文件夹不存在: {0}

# BackupService_Log_NoMatchingFiles
source: {0} has no files matching its source include rules and was skipped.
zh_cn: {0} 当前没有符合来源包含规则的文件，已跳过

# BackupService_Log_DestinationNotSet
source: Backup destination path is not set.
zh_cn: 未设置备份目标路径！

# BackupService_Log_SourceDestinationOverlap
source: Backup blocked because source and storage paths overlap: {0} ↔ {1}
zh_cn: 来源与备份存储路径重叠，已阻止备份：{0} ↔ {1}

# FolderManager_SourceDestinationOverlap_Content
source: The following sources overlap the backup project's backup or metadata directory and were not added:\n{0}
zh_cn: 以下来源与当前备份项目的备份目录或元数据目录重叠，因此未添加：\n{0}

# BackupService_Log_ProcessingFolder
source: Processing: {0}
zh_cn: 处理中: {0}

# BackupService_Log_Exception
source: Exception: {0}
zh_cn: 异常: {0}

# BackupService_Log_BackupSucceeded
source: {0} backup succeeded.
zh_cn: {0} 备份成功

# BackupService_Log_BackupSkippedNoChanges
source: {0} skipped (no file changes).
zh_cn: {0} 无文件变更

# BackupService_Log_BackupFailed
source: {0} backup not completed.
zh_cn: {0} 备份未完成

# BackupService_Log_PluginTakeover
source: Plugin {0} took over backup: {1}
zh_cn: 插件 {0} 接管备份: {1}

# BackupService_Log_PluginBackupSucceeded
source: [Plugin] {0} backup succeeded.
zh_cn: [插件完成] {0} 备份成功

# BackupService_Log_PluginBackupSkippedNoChanges
source: [Plugin] {0} skipped (no file changes).
zh_cn: [插件跳过] {0} 无文件变更

# BackupService_Log_PluginBackupFailed
source: [Plugin] {0} failed: {1}
zh_cn: [插件失败] {0} - {1}

# BackupService_Log_PluginRestoreTakeover
source: Plugin {0} took over restore: {1}
zh_cn: 插件 {0} 接管还原: {1}

# BackupService_Log_PluginRestoreSucceeded
source: [Plugin] {0} restore succeeded.
zh_cn: [插件完成] {0} 还原成功

# BackupService_Log_PluginRestoreFailed
source: [Plugin] {0} restore failed: {1}
zh_cn: [插件失败] {0} - {1}

# BackupService_Log_PluginException
source: [Plugin] {0} exception: {1}
zh_cn: [插件异常] {0} - {1}

# BackupService_Log_MetadataCorruptedFallbackFull
source: Metadata is corrupted. Falling back to full backup.
zh_cn: 元数据损坏，将执行全量备份

# BackupService_Log_NoBaselineMetadataFallbackFull
source: Baseline metadata not found. Falling back to full backup.
zh_cn: 未找到基准元数据，转为全量备份

# BackupService_Log_AnalyzingDiff
source: Analyzing file differences...
zh_cn: 正在对比文件差异...

# BackupService_Log_NoChangesDetected
source: No file changes detected.
zh_cn: 没有检测到文件变更

# BackupService_Log_ReferencedBackupMissing
source: Referenced backup file is missing: {0}. Forcing full backup.
zh_cn: 元数据引用的备份文件不存在: {0}，将强制执行全量备份

# BackupMetadataStore_Log_LegacyMigrationFailedFallback
source: Legacy metadata migration failed. Continuing with compatibility read: {0}
zh_cn: 旧版元数据迁移失败，将继续使用兼容读取: {0}

# BackupMetadataStore_Log_WriteFailed
source: Failed to save the new backup metadata structure: {0}
zh_cn: 写入新版备份元数据失败: {0}

# BackupMetadataStore_Log_WriteFailedSimple
source: Failed to save the new backup metadata structure.
zh_cn: 写入新版备份元数据失败

# BackupMetadataStore_Log_RecordMissingFallback
source: Metadata record for archive {0} is missing. Falling back to compatibility restore.
zh_cn: 缺少归档 {0} 的元数据记录，将回退到兼容还原链

# BackupService_Log_ChangesDetected
source: Detected {0} changed files.
zh_cn: 检测到 {0} 个文件变更

# BackupService_Log_NoExistingBackupFallbackFull
source: No existing backup found. Running full backup.
zh_cn: 未找到已有备份，将执行全量备份

# BackupService_Log_RollingUpdating
source: Rolling: creating a new archive from immutable baseline {0}
zh_cn: Rolling：正在从不可变基线创建新归档：{0}

# BackupService_Log_RenamedTo
source: Renamed to: {0}
zh_cn: 重命名: 更新为: {0}

# BackupService_Log_BackupFileNotFound
source: Backup file not found: {0}
zh_cn: 备份文件未找到: {0}

# BackupService_Log_RestoreChainNotFound
source: No restore chain found.
zh_cn: 找不到可用于还原的备份链。

# BackupService_Log_RestoreBegin
source: === Restoring: {0} ===
zh_cn: === 开始还原: {0} ===

# BackupService_Log_RestoreTargetBackup
source: -> Target backup: {0}
zh_cn: -> 目标备份: {0}

# BackupService_Log_RestoreTargetPath
source: -> Target path: {0}
zh_cn: -> 目标路径: {0}

# BackupService_Log_RestoreCleaningTarget
source: Cleaning target directory...
zh_cn: 正在清空目标目录...

# BackupService_Log_RestoreCleanFailedContinueOverwrite
source: Failed to clean directory: {0}. Trying to continue with overwrite...
zh_cn: 清理目录失败：{0}，尝试继续覆写还原...

# BackupService_Log_RestoreApplyingArchive
source: Applying {0}
zh_cn: 应用 {0}

# BackupService_Log_RestoreExtractFailed
source: 7-Zip extraction failed. Check logs for details.
zh_cn: 7z 解压出错，请检查日志。

# BackupService_Log_RestoreCompleted
source: Restore completed.
zh_cn: 还原操作完成！

# BackupService_Log_NoBaseFullFoundTryIncrementOnly
source: No matching full backup found; will try restoring only the selected incremental archive.
zh_cn: 找不到对应的全量备份，将仅尝试还原所选增量包。

# BackupService_Log_SevenZipNotFound
source: Critical: 7-Zip executable not found. Set 7z.exe/7zz.exe in settings.
zh_cn: 严重错误：找不到 7z 可执行文件，请在设置中指定 7z.exe/7zz.exe。

# BackupService_Log_SystemError
source: System error: {0}
zh_cn: 系统错误: {0}

# BackupService_Log_InvalidStorageFolderName
source: The current folder display name cannot be mapped safely to a backup directory. Rename it and try again.
zh_cn: 当前文件夹显示名称无法安全映射到备份目录，请修改后重试。

# BackupService_Log_InvalidRestoreStorageFolderName
source: The folder name stored in this history entry cannot be mapped safely to the metadata directory, so restore cannot continue.
zh_cn: 当前历史记录对应的文件夹名称无法安全映射到元数据目录，无法继续还原。

# BackupService_Log_SevenZipStartFailed
source: Failed to start 7z process.
zh_cn: 无法启动 7z 进程。

# BackupService_Log_SevenZipTimeout
source: 7z process timed out ({0}s).
zh_cn: 7z 进程执行超时（{0} 秒）。

# BackupService_Log_BackupBeforeRestore
source: Backup before restore: {0}
zh_cn: 还原前自动备份: {0}

# BackupService_Log_BackupBeforeRestoreCompleted
source: Pre-restore backup completed
zh_cn: 还原前备份完成

# BackupService_Log_BackupBeforeRestoreFailed
source: Pre-restore backup failed: {0}, continuing restore...
zh_cn: 还原前备份失败: {0}，继续还原...

# BackupService_Log_RestoreWhitelistSkip
source: Restore whitelist skip: {0}
zh_cn: 还原白名单跳过: {0}

# BackupService_Log_RestoreDeleteFileFailed
source: Failed to delete: {0} - {1}
zh_cn: 删除文件失败: {0} - {1}

# BackupService_Log_RestoreChainBuilt
source: Restore chain built with {0} archives
zh_cn: 还原链已构建，包含 {0} 个包

# BackupService_Log_RestoreIntegrityCheckBegin
source: Starting restore integrity check for {0} archive(s)
zh_cn: 开始校验还原链完整性，共 {0} 个压缩包

# BackupService_Log_RestoreIntegrityArchiveCheckFailed
source: Integrity check failed before restore: {0}
zh_cn: 还原前完整性校验失败：{0}

# BackupService_Log_RestoreIntegrityCheckPassed
source: Restore integrity check passed
zh_cn: 还原前完整性校验通过

# BackupService_Log_RestoreIntegrityCheckFailedStop
source: Restore aborted: backup integrity check failed
zh_cn: 还原已终止：备份完整性校验未通过

# BackupService_Log_RestoreSnapshotPrepared
source: Safe restore snapshot created: {0}
zh_cn: 已创建安全还原快照：{0}

# BackupService_Log_RestoreSnapshotPrepareFailed
source: Failed to create safe restore snapshot: {0}
zh_cn: 创建安全还原快照失败：{0}

# BackupService_Log_RestoreRollbackBegin
source: Restore failed, starting rollback from snapshot: {0}
zh_cn: 还原失败，开始回滚目录快照：{0}

# BackupService_Log_RestoreRollbackSuccess
source: Rollback completed, pre-restore state recovered
zh_cn: 回滚完成，已恢复还原前目录状态

# BackupService_Log_RestoreRollbackFailed
source: Rollback failed: {0}
zh_cn: 回滚失败：{0}

# BackupService_Log_RestoreCommitFailed
source: Failed to commit safe restore result: {0}
zh_cn: 提交安全还原结果失败：{0}

# App_WindowTitle
source: FolderRewind
zh_cn: 存档时光机

# History_RestoreConfirm_Title
source: Confirm restore
zh_cn: 确认还原版本

# History_RestoreConfirm_Content
source: Time: {0} Comment: {1} [Clean] Mode: Clear the target folder first, then restore (recommended). [Overwrite] Mode: Extract and overwrite (may keep old files).
zh_cn: 时间：{0} 备注：{1} 安全还原模式：先清空目标文件夹，再还原（推荐，防止残留）。 覆写还原模式：直接解压覆盖（可能保留旧文件）。

# History_RestoreConfirm_Primary
source: Clean restore
zh_cn: 安全还原

# History_RestoreConfirm_Secondary
source: Overwrite restore
zh_cn: 覆写还原

# SettingsPage_KnotLinkStatus_Disabled
source: Disabled
zh_cn: 未启用

# SettingsPage_KnotLinkStatus_Connected
source: Connected. Command responder and signal sender are running.
zh_cn: 已连接，命令响应器和信号发送器均正常运行

# SettingsPage_KnotLinkStatus_Partial
source: Partially connected (Responder: {0}, Sender: {1})
zh_cn: 部分连接 (响应器: {0}, 发送器: {1})

# SettingsPage_KnotLinkStatus_InitFailed
source: Initialized but connection failed. Check whether the KnotLink service is running.
zh_cn: 已初始化但连接失败，请检查 KnotLink 服务是否运行

# SettingsPage_KnotLinkStatus_NotInitialized
source: Service not initialized. Please click [Restart service].
zh_cn: 服务未初始化，请点击 [重启服务]

# SettingsPage_KnotLinkServerVersion.Text
source: Server Version
zh_cn: 服务端版本

# SettingsPage_KnotLinkServerNotInstalled
source: KnotLink server not detected
zh_cn: 未检测到 KnotLink 服务端

# SettingsPage_KnotLinkStartServer.Content
source: Start Server
zh_cn: 启动服务端

# SettingsPage_KnotLinkCheckServerUpdate.Content
source: Check for Updates
zh_cn: 检测更新

# SettingsPage_KnotLinkUpdateServer.Content
source: Update Server
zh_cn: 更新服务端

# SettingsPage_KnotLinkCheckUpdate
source: Check for Updates
zh_cn: 检测更新

# SettingsPage_KnotLinkUpdateAvailable
source: Update available: {0}
zh_cn: 有新版本可用: {0}

# SettingsPage_KnotLinkUpToDate
source: Up to date
zh_cn: 已是最新版本

# SettingsPage_KnotLinkAutoStart.Text
source: Auto-start Server
zh_cn: 自动启动服务端

# SettingsPage_KnotLinkAutoStartDesc.Text
source: Automatically start KnotLink server on app launch
zh_cn: 应用启动时自动启动 KnotLink 服务端

# SettingsPage_KnotLinkUpdateServerError
source: Update check failed: {0}
zh_cn: 更新检测失败: {0}

# SettingsPage_KnotLinkServer_StartSuccess
source: KnotLink server started
zh_cn: KnotLink 服务端已启动

# SettingsPage_KnotLinkServer_StartFailed
source: Failed to start. Please ensure the server is installed.
zh_cn: 启动失败，请确认服务端已安装

# SettingsPage_KnotLinkServerNoInstaller
source: No installer download URL found
zh_cn: 未找到安装包下载地址

# SettingsPage_KnotLinkServer_InstallerLaunched
source: Server installer launched. Please complete installation and restart the app.
zh_cn: 服务端安装程序已启动，请完成安装后重启应用

# KnotLinkCompatibility_DialogTitle
source: KnotLink Server Update Required
zh_cn: 需要更新 KnotLink 服务端

# KnotLinkCompatibility_DialogContent
source: The installed KnotLink server version is {0}. FolderRewind 1.9.0 requires KnotLink server version {1} or later. Update the server to ensure compatibility.
zh_cn: 检测到已安装的 KnotLink 服务端版本为 {0}。FolderRewind 1.9.0 要求服务端版本至少为 {1}。请更新服务端以确保兼容。
